# CC_RouteFromShape

## Description
Creates cable route from the given shape. The shape must be polygon, polyline or 3D polygon.

```pascal
PROCEDURE CC_RouteFromShape(hObj : HANDLE);
```

```python
def vs.CC_RouteFromShape(hObj):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE|   |

## Version
Availability: from Vectorworks 2022

## Category
* ConnectCAD